// Задание 2: Напишите программу, которая на вход принимает два числа и выдает, какое число большее, а какое меньшее.
int a = int.Parse(Console.ReadLine());
int b = int.Parse(Console.ReadLine());
if (a < d)
{
    Console.WriteLine(b);
}else{
    Console.WriteLine(a);
}